import Tag from '../components/Tag';
import Page from '../components/Page';

export default class Terms extends React.Component{
	static getInitialProps(){
		const title = 'قوانین و مقررات';
		const description = 'قوانین و مقررات استفاده از سامانه اینترنتی مدیریت قرض الحسنه فامیلی بانکمون برای موسسین قرض الحسنه و افراد صاحب حساب';
		const canonical = '/terms/';
		const structuredData = {
			"@context": "http://schema.org",
			"@type": "WebPage",
			"url": `https://bankemoon.com${canonical}`,
			"name": title + ' بانکمون',
			"about": "Terms of Website",
			"creator": {
				"@type": "Organization",
				"name": "بانکمون"
			},
			"mainContentOfPage": '.page',
			"relatedLink": "https://bankemoon.com/portal/",
			"significantLink": "https://bankemoon.com/portal/",
			"keywords": "قوانین,مقررات,قوانین بانکمون,بانکمون"
		};

		return {
			structuredData,
			title,
			description,
			canonical,
		};
	}

	render(){
		return(
			<Page {...this.props}>
				<div className='w-text-700'>
					<ul className='list-unstyled text-justify terms-list'>
						<li>
							<h3>قوانین کلی</h3>
							<ul style={{ listStyleType: 'decimal' }}>
								<li className='mb-3'>
									<p>
										<Tag href='/'>بانکمون</Tag> صرفا یک سامانه برای مدیریت حساب‌ها و راه ارتباطی بین صاحبین حساب و موسس <Tag href='/'>قرض‌الحسنه</Tag> بوده و هیچگونه ماهیت مالی یا ارتباط با بانک مرکزی ندارد.
									</p>
								</li>

								<li className='mb-3'>
									<p>
										اطلاعات دریافتی از اشخاص، نزد <Tag href='/'>بانکمون</Tag> محفوظ مانده و تحت هیچ شرایطی در اختیار افراد دیگر و یا برای فروش و تبلیغات مورد استفاده قرار نمی‌گیرد و صرفا راهی برای ارائه‌ی اعلان‌ها و تایید هویت شخص  است. البته باید در نظر داشت که <Tag href='/'>بانکمون</Tag> در کشور جمهوری اسلامی ایران مدیریت شده و تابع قوانین کشور بوده و درصورت دریافت دستور از مراجع ذیصلاح، لازم است تا این اطلاعات در دسترس مراجع قرار گیرد.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									اطلاعات جمع‌آوری شده توسط <Tag href='/'>بانکمون</Tag>، اطلاعاتی است که استفاده کننده در اختیار ما قرار می‌دهد و هیچگونه اطلاعاتی از مرورگر و ... در جهت تبلیغات استفاده نخواهد شد.
									</p>
								</li>
							</ul>
						</li>

						<li>
							<h3>قوانین مربوط به صاحب قرض‌الحسنه</h3>
							<ul style={{ listStyleType: 'decimal' }}>
								<li className='mb-3'>
									<p>
										برای ساخت <Tag href='/'>قرض‌الحسنه</Tag> در سامانه مدیریت <Tag href='/'>قرض‌الحسنه‌ی</Tag> خانوادگی <Tag href='/'>بانکمون</Tag>، مدارک شناسایی از موسس دریافت می‌شود تا از صحت هویت و همچنین جلوگیری از پولشویی و کلاه‌برداری در پرداخت‌های اینترنتی جلوگیری شود.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									صاحب <Tag href='/'>قرض‌الحسنه</Tag> می‌تواند با وارد کردن مشخصات افراد، آنها را در <Tag href='/'>بانکمون</Tag> عضو کرده و به <Tag href='/'>قرض‌الحسنه‌ی</Tag> خود اضافه کند. اما درصورت عضویت افراد به صورت تصادفی و ثبت چند شکایت از جانب کاربران، <Tag href='/'>قرض‌الحسنه</Tag> بسته شده و موسس از <Tag href='/'>بانکمون</Tag> اخراج می‌شود.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									نگهداری از تمامی اطلاعات حساب و کاربران برعهده‌ی <Tag href='/'>بانکمون</Tag> است و به صورت روزانه از تمامی اطلاعات، فایل پشتیبان گرفته خواهد شد. اما پیشنهاد می‌شود برای امنیت بیشتر و دسترسی  به گزارشات بصورت آفلاین، هر ماه از تراکنش‌های <Tag href='/'>قرض‌الحسنه‌ی</Tag> خود، یک خروجی PDF دریافت کنید.
									</p>
								</li>

								<li className='mb-3'>
									<p>
										موسس <Tag href='/'>قرض‌الحسنه</Tag> حتما باید بالای 18 سال داشته باشد. در غیر این صورت مورد تایید <Tag href='/'>بانکمون</Tag> قرار نگرفته و <Tag href='/'>قرض‌الحسنه</Tag> بسته می‌شود.
									</p>
								</li>
							</ul>
						</li>

						<li>
							<h3>قوانین مربوط به صاحب حساب</h3>
							<ul style={{ listStyleType: 'decimal' }}>
								<li className='mb-3'>
									<p>
									موسسین قرض‌الحسنه‌ها به <Tag href='/'>بانکمون</Tag> متصل نبوده و صرفا هویت آنها با دریافت مدارک شناسایی تایید می‌شود. بنابراین قبل از واریز هرگونه وجه به حساب قرض‌الحسنه، چه از طریق <Tag href='/'>بانکمون</Tag> به صورت اینترنتی و یا به طرق مختلف دیگر، حتما از صحت وجود <Tag href='/'>قرض‌الحسنه</Tag> و معتبر بودن موسس آن از طریق مشخصات و راه‌های ارتباطی که داخل <Tag href='/portal/'>سامانه</Tag> برای هر <Tag href='/'>قرض‌الحسنه</Tag> به صورت مجزا ثبت شده است، اطمینان حاصل کنید.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									در <Tag href='/'>بانکمون</Tag> از صاحبین حساب برای ثبت‌نام، مدارک شناسایی دریافت نمی‌شود. اما درصورتی که <Tag href='/'>قرض‌الحسنه</Tag> تمایل به دادن وام به صورت اینترنتی داشته باشد، برای جلوگیری از کلاه‌برداری و پولشویی از صاحب حساب نیز برای تایید هویت، مدارک شناسایی دریافت خواهد شد.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									قبل از واریز هرگونه وجه به حساب <Tag href='/'>قرض‌الحسنه</Tag> از طریق <Tag href='/'>بانکمون</Tag>، از صحت شماره شبا و نام موسس اطمینان حاصل کنید.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									وجه واریزی از سمت صاحب حساب مستقیما به حساب صاحب <Tag href='/'>قرض‌الحسنه</Tag> واریز شده و امکان برگشت زدن از سمت <Tag href='/'>بانکمون</Tag> وجود ندارد.
									</p>
								</li>

								<li className='mb-3'>
									<p>
									درصورتی که وجه از حساب شما کم شد اما تراکنش با موفقیت انجام نگرفت، وجه تا حداکثر 72 ساعت به حساب شما برمی‌گردد.
									</p>
								</li>
							</ul>
						</li>
					</ul>
				</div>
			</Page>
		);
	}
}
